"""
Порівняти ефективність алгоритмів пошуку підрядка: Боєра-Мура, Кнута-Морріса-Пратта та Рабіна-Карпа 
на основі двох текстових файлів (стаття 1, стаття 2). 
Використовуючи timeit, треба виміряти час виконання кожного алгоритму для двох видів підрядків: 
одного, що дійсно існує в тексті, та іншого — вигаданого (вибір підрядків за вашим бажанням). 
На основі отриманих даних визначити найшвидший алгоритм для кожного тексту окремо та в цілому.
"""

filename = "titl1.txt"



with open(filename, "r") as file:
  # Read entire content
  content = file.read()
  print(content)

  # # Read line by line
  # for line in file:
  #   print(line)

  # # Read all lines into a list
  # lines = file.readlines()